9/data/attachments/22f343afab409d0a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_c830943d-530c-4cd1-ac17-fa57ba46da67</nif:username>
            <nif:friendToBeAdded>Nicholas_middle_Actions_27692_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>